#include <iostream> // Підключаємо бібліотеку для вводу-виводу
using namespace std; // Використовуємо простір імен std для спрощення коду

int main(void) { // Головна функція програми
    double pi4 = 0.; // Ініціалізуємо змінну для обчислення частини числа π/4
    long n; // Оголошуємо змінну для зберігання кількості ітерацій
    cout << "Number of iterations? "; // Запитуємо користувача про кількість ітерацій
    cin >> n; // Зчитуємо введене число в змінну n

    for (long i = 0; i < n; i++) { // Цикл для n ітерацій
        // Додаємо або віднімаємо 1/(2*i + 1) залежно від парності i
        pi4 += (i % 2 == 0) ? 1. / (2. * i + 1.) : -1. / (2. * i + 1.); 
    }

    cout.precision(20); // Встановлюємо точність виводу на 20 знаків після крапки
    cout << "Pi = " << (pi4 * 4.) << endl; // Обчислюємо та виводимо значення π, помноживши pi4 на 4
    return 0; // Завершуємо програму
}
